; domain
(define (domain gripper-typed)
   (:requirements :typing)
   (:types room ball gripper)
   (:constants left right - gripper)
   (:predicates (at-robby ?dummy - room ?r - room)
		(at ?dummy - ball ?b - ball ?r - room)
		(free ?dummy - gripper ?g - gripper)
		(carry ?dummy - ball ?o - ball ?g - gripper))

   (:action move
       :parameters  (?from ?to - room)
       :precondition (at-robby ?from ?from)
       :effect (and  (at-robby ?to ?to)
		     (not (at-robby ?from ?from))))



   (:action pick
       :parameters (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (at ?obj ?obj ?room) (at-robby ?room ?room) (free ?gripper ?gripper))
       :effect (and (carry ?obj ?obj ?gripper)
		    (not (at ?obj ?obj ?room))
		    (not (free ?gripper ?gripper))))


   (:action drop
       :parameters  (?obj - ball ?room - room ?gripper - gripper)
       :precondition  (and  (carry ?obj ?obj ?gripper) (at-robby ?room ?room))
       :effect (and (at ?obj ?obj ?room)
		    (free ?gripper ?gripper)
		    (not (carry ?obj ?obj ?gripper)))))

; problem
(define (problem gripper-x-5)
   (:domain gripper-typed)
   (:objects rooma roomb - room
             ball12 ball11 ball10 ball9 ball8 ball7 ball6 ball5 ball4 ball3
             ball2 ball1 - ball)
   (:init (at-robby rooma rooma)
          (free left left)
          (free right right)
          (at ball12 ball12 rooma)
          (at ball11 ball11 rooma)
          (at ball10 ball10 rooma)
          (at ball9 ball9 rooma)
          (at ball8 ball8 rooma)
          (at ball7 ball7 rooma)
          (at ball6 ball6 rooma)
          (at ball5 ball5 rooma)
          (at ball4 ball4 rooma)
          (at ball3 ball3 rooma)
          (at ball2 ball2 rooma)
          (at ball1 ball1 rooma))
   (:goal (and (at ball12 ball12 roomb)
               (at ball11 ball11 roomb)
               (at ball10 ball10 roomb)
               (at ball9 ball9 roomb)
               (at ball8 ball8 roomb)
               (at ball7 ball7 roomb)
               (at ball6 ball6 roomb)
               (at ball5 ball5 roomb)
               (at ball4 ball4 roomb)
               (at ball3 ball3 roomb)
               (at ball2 ball2 roomb)
               (at ball1 ball1 roomb))))

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 ball1 rooma) (free left left)
   added: (carry ball1 ball1 left)
   goals met: 0 of 12
2. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 0 of 12
3. (drop ball1 roomb left)
   deleted: (carry ball1 ball1 left)
   added: (at ball1 ball1 roomb) (free left left)
   goals met: 1 of 12
4. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 1 of 12
5. (pick ball11 rooma left)
   deleted: (at ball11 ball11 rooma) (free left left)
   added: (carry ball11 ball11 left)
   goals met: 1 of 12
6. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 1 of 12
7. (drop ball11 roomb left)
   deleted: (carry ball11 ball11 left)
   added: (at ball11 ball11 roomb) (free left left)
   goals met: 2 of 12
8. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 2 of 12
9. (pick ball4 rooma right)
   deleted: (at ball4 ball4 rooma) (free right right)
   added: (carry ball4 ball4 right)
   goals met: 2 of 12
10. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 2 of 12
11. (drop ball4 roomb right)
   deleted: (carry ball4 ball4 right)
   added: (at ball4 ball4 roomb) (free right right)
   goals met: 3 of 12
12. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 3 of 12
13. (pick ball10 rooma left)
   deleted: (at ball10 ball10 rooma) (free left left)
   added: (carry ball10 ball10 left)
   goals met: 3 of 12
14. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 3 of 12
15. (drop ball10 roomb left)
   deleted: (carry ball10 ball10 left)
   added: (at ball10 ball10 roomb) (free left left)
   goals met: 4 of 12
16. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 4 of 12
17. (pick ball3 rooma right)
   deleted: (at ball3 ball3 rooma) (free right right)
   added: (carry ball3 ball3 right)
   goals met: 4 of 12
18. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 4 of 12
19. (drop ball3 roomb right)
   deleted: (carry ball3 ball3 right)
   added: (at ball3 ball3 roomb) (free right right)
   goals met: 5 of 12
20. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 5 of 12
21. (pick ball12 rooma left)
   deleted: (at ball12 ball12 rooma) (free left left)
   added: (carry ball12 ball12 left)
   goals met: 5 of 12
22. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 5 of 12
23. (drop ball12 roomb left)
   deleted: (carry ball12 ball12 left)
   added: (at ball12 ball12 roomb) (free left left)
   goals met: 6 of 12
24. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 6 of 12
25. (pick ball8 rooma right)
   deleted: (at ball8 ball8 rooma) (free right right)
   added: (carry ball8 ball8 right)
   goals met: 6 of 12
26. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 6 of 12
27. (drop ball8 roomb right)
   deleted: (carry ball8 ball8 right)
   added: (at ball8 ball8 roomb) (free right right)
   goals met: 7 of 12
28. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 7 of 12
29. (pick ball2 rooma left)
   deleted: (at ball2 ball2 rooma) (free left left)
   added: (carry ball2 ball2 left)
   goals met: 7 of 12
30. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 7 of 12
31. (drop ball2 roomb left)
   deleted: (carry ball2 ball2 left)
   added: (at ball2 ball2 roomb) (free left left)
   goals met: 8 of 12
32. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 8 of 12
33. (pick ball7 rooma right)
   deleted: (at ball7 ball7 rooma) (free right right)
   added: (carry ball7 ball7 right)
   goals met: 8 of 12
34. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 8 of 12
35. (drop ball7 roomb right)
   deleted: (carry ball7 ball7 right)
   added: (at ball7 ball7 roomb) (free right right)
   goals met: 9 of 12
36. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 9 of 12
37. (pick ball5 rooma left)
   deleted: (at ball5 ball5 rooma) (free left left)
   added: (carry ball5 ball5 left)
   goals met: 9 of 12
38. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 9 of 12
39. (drop ball5 roomb left)
   deleted: (carry ball5 ball5 left)
   added: (at ball5 ball5 roomb) (free left left)
   goals met: 10 of 12
40. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 10 of 12
41. (pick ball6 rooma right)
   deleted: (at ball6 ball6 rooma) (free right right)
   added: (carry ball6 ball6 right)
   goals met: 10 of 12
42. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 10 of 12
43. (drop ball6 roomb right)
   deleted: (carry ball6 ball6 right)
   added: (at ball6 ball6 roomb) (free right right)
   goals met: 11 of 12
44. (move roomb rooma)
   deleted: (at-robby roomb roomb)
   added: (at-robby rooma rooma)
   goals met: 11 of 12
45. (pick ball9 rooma left)
   deleted: (at ball9 ball9 rooma) (free left left)
   added: (carry ball9 ball9 left)
   goals met: 11 of 12
46. (move rooma roomb)
   deleted: (at-robby rooma rooma)
   added: (at-robby roomb roomb)
   goals met: 11 of 12
47. (drop ball9 roomb left)
   deleted: (carry ball9 ball9 left)
   added: (at ball9 ball9 roomb) (free left left)
   goals met: 12 of 12
